grevaillot/svd_tools/headers/STM32G441xx/fdcan1.h
#pragma once 

/* --- FDCAN1: FDCAN ------------------------------------------------ */

/** @defgroup fdcan1_registers FDCAN Register
@{*/

/** FDCAN1_CREL FDCAN Core Release Register **/
#define FDCAN1_CREL			MMIO32(FDCAN1_BASE + 0x00)
/** FDCAN1_ENDN FDCAN Core Release Register **/
#define FDCAN1_ENDN			MMIO32(FDCAN1_BASE + 0x04)
/** FDCAN1_DBTP This register is only writable if bits CCCR.CCE and CCCR.INIT are set. The CAN bit time may be programed in the range of 4 to 25 time quanta. The CAN time quantum may be programmed in the range of 1 to 1024 FDCAN clock periods. tq = (DBRP + 1) FDCAN clock period. DTSEG1 is the sum of Prop_Seg and Phase_Seg1. DTSEG2 is Phase_Seg2. Therefore the length of the bit time is (programmed values) [DTSEG1 + DTSEG2 + 3] tq or (functional values) [Sync_Seg + Prop_Seg + Phase_Seg1 + Phase_Seg2] tq. The Information Processing Time (IPT) is zero, meaning the data for the next bit is available at the first clock edge after the sample point. **/
#define FDCAN1_DBTP			MMIO32(FDCAN1_BASE + 0x0c)
/** FDCAN1_TEST Write access to the Test Register has to be enabled by setting bit CCCR[TEST] to 1 . All Test Register functions are set to their reset values when bit CCCR[TEST] is reset. Loop Back mode and software control of Tx pin FDCANx_TX are hardware test modes. Programming TX differently from 00 may disturb the message transfer on the CAN bus. **/
#define FDCAN1_TEST			MMIO32(FDCAN1_BASE + 0x10)
/** FDCAN1_RWD The RAM Watchdog monitors the READY output of the Message RAM. A Message RAM access starts the Message RAM Watchdog Counter with the value configured by the RWD[WDC] bits. The counter is reloaded with RWD[WDC] bits when the Message RAM signals successful completion by activating its READY output. In case there is no response from the Message RAM until the counter has counted down to 0, the counter stops and interrupt flag IR[WDI] bit is set. The RAM Watchdog Counter is clocked by the fdcan_pclk clock. **/
#define FDCAN1_RWD			MMIO32(FDCAN1_BASE + 0x14)
/** FDCAN1_CCCR For details about setting and resetting of single bits see Software initialization. **/
#define FDCAN1_CCCR			MMIO32(FDCAN1_BASE + 0x18)
/** FDCAN1_NBTP FDCAN_NBTP **/
#define FDCAN1_NBTP			MMIO32(FDCAN1_BASE + 0x1c)
/** FDCAN1_TSCC FDCAN Timestamp Counter Configuration Register **/
#define FDCAN1_TSCC			MMIO32(FDCAN1_BASE + 0x20)
/** FDCAN1_TSCV FDCAN Timestamp Counter Value Register **/
#define FDCAN1_TSCV			MMIO32(FDCAN1_BASE + 0x24)
/** FDCAN1_TOCC FDCAN Timeout Counter Configuration Register **/
#define FDCAN1_TOCC			MMIO32(FDCAN1_BASE + 0x28)
/** FDCAN1_TOCV FDCAN Timeout Counter Value Register **/
#define FDCAN1_TOCV			MMIO32(FDCAN1_BASE + 0x2c)
/** FDCAN1_ECR FDCAN Error Counter Register **/
#define FDCAN1_ECR			MMIO32(FDCAN1_BASE + 0x40)
/** FDCAN1_PSR FDCAN Protocol Status Register **/
#define FDCAN1_PSR			MMIO32(FDCAN1_BASE + 0x44)
/** FDCAN1_TDCR FDCAN Transmitter Delay Compensation Register **/
#define FDCAN1_TDCR			MMIO32(FDCAN1_BASE + 0x48)
/** FDCAN1_IR The flags are set when one of the listed conditions is detected (edge-sensitive). The flags remain set until the Host clears them. A flag is cleared by writing a 1 to the corresponding bit position. Writing a 0 has no effect. A hard reset will clear the register. The configuration of IE controls whether an interrupt is generated. The configuration of ILS controls on which interrupt line an interrupt is signaled. **/
#define FDCAN1_IR			MMIO32(FDCAN1_BASE + 0x50)
/** FDCAN1_IE The settings in the Interrupt Enable register determine which status changes in the Interrupt Register will be signaled on an interrupt line. **/
#define FDCAN1_IE			MMIO32(FDCAN1_BASE + 0x54)
/** FDCAN1_ILS The Interrupt Line Select register assigns an interrupt generated by a specific interrupt flag from the Interrupt Register to one of the two module interrupt lines. For interrupt generation the respective interrupt line has to be enabled via ILE[EINT0] and ILE[EINT1]. **/
#define FDCAN1_ILS			MMIO32(FDCAN1_BASE + 0x58)
/** FDCAN1_ILE Each of the two interrupt lines to the CPU can be enabled/disabled separately by programming bits EINT0 and EINT1. **/
#define FDCAN1_ILE			MMIO32(FDCAN1_BASE + 0x5c)
/** FDCAN1_RXGFC Global settings for Message ID filtering. The Global Filter Configuration controls the filter path for standard and extended messages as described in Figure706: Standard Message ID filter path and Figure707: Extended Message ID filter path. **/
#define FDCAN1_RXGFC			MMIO32(FDCAN1_BASE + 0x80)
/** FDCAN1_XIDAM FDCAN Extended ID and Mask Register **/
#define FDCAN1_XIDAM			MMIO32(FDCAN1_BASE + 0x84)
/** FDCAN1_HPMS This register is updated every time a Message ID filter element configured to generate a priority event match. This can be used to monitor the status of incoming high priority messages and to enable fast access to these messages. **/
#define FDCAN1_HPMS			MMIO32(FDCAN1_BASE + 0x88)
/** FDCAN1_RXF0S FDCAN Rx FIFO 0 Status Register **/
#define FDCAN1_RXF0S			MMIO32(FDCAN1_BASE + 0x90)
/** FDCAN1_RXF0A CAN Rx FIFO 0 Acknowledge Register **/
#define FDCAN1_RXF0A			MMIO32(FDCAN1_BASE + 0x94)
/** FDCAN1_RXF1S FDCAN Rx FIFO 1 Status Register **/
#define FDCAN1_RXF1S			MMIO32(FDCAN1_BASE + 0x98)
/** FDCAN1_RXF1A FDCAN Rx FIFO 1 Acknowledge Register **/
#define FDCAN1_RXF1A			MMIO32(FDCAN1_BASE + 0x9c)
/** FDCAN1_TXBC FDCAN Tx Buffer Configuration Register **/
#define FDCAN1_TXBC			MMIO32(FDCAN1_BASE + 0xc0)
/** FDCAN1_TXFQS The Tx FIFO/Queue status is related to the pending Tx requests listed in register TXBRP. Therefore the effect of Add/Cancellation requests may be delayed due to a running Tx scan (TXBRP not yet updated). **/
#define FDCAN1_TXFQS			MMIO32(FDCAN1_BASE + 0xc4)
/** FDCAN1_TXBRP FDCAN Tx Buffer Request Pending Register **/
#define FDCAN1_TXBRP			MMIO32(FDCAN1_BASE + 0xc8)
/** FDCAN1_TXBAR FDCAN Tx Buffer Add Request Register **/
#define FDCAN1_TXBAR			MMIO32(FDCAN1_BASE + 0xcc)
/** FDCAN1_TXBCR FDCAN Tx Buffer Cancellation Request Register **/
#define FDCAN1_TXBCR			MMIO32(FDCAN1_BASE + 0xd0)
/** FDCAN1_TXBTO FDCAN Tx Buffer Transmission Occurred Register **/
#define FDCAN1_TXBTO			MMIO32(FDCAN1_BASE + 0xd4)
/** FDCAN1_TXBCF FDCAN Tx Buffer Cancellation Finished Register **/
#define FDCAN1_TXBCF			MMIO32(FDCAN1_BASE + 0xd8)
/** FDCAN1_TXBTIE FDCAN Tx Buffer Transmission Interrupt Enable Register **/
#define FDCAN1_TXBTIE			MMIO32(FDCAN1_BASE + 0xdc)
/** FDCAN1_TXBCIE FDCAN Tx Buffer Cancellation Finished Interrupt Enable Register **/
#define FDCAN1_TXBCIE			MMIO32(FDCAN1_BASE + 0xe0)
/** FDCAN1_TXEFS FDCAN Tx Event FIFO Status Register **/
#define FDCAN1_TXEFS			MMIO32(FDCAN1_BASE + 0xe4)
/** FDCAN1_TXEFA FDCAN Tx Event FIFO Acknowledge Register **/
#define FDCAN1_TXEFA			MMIO32(FDCAN1_BASE + 0xe8)
/** FDCAN1_CKDIV FDCAN CFG clock divider register **/
#define FDCAN1_CKDIV			MMIO32(FDCAN1_BASE + 0x100)

/**@}*/


/** @defgroup fdcan1_crel CREL FDCAN Core Release Register
@{*/


#define FDCAN1_CREL_REL_SHIFT		28
#define FDCAN1_CREL_REL_MASK		0x0f
/** @defgroup fdcan1_crel_rel REL REL
@{*/
/**@}*/


#define FDCAN1_CREL_STEP_SHIFT		24
#define FDCAN1_CREL_STEP_MASK		0x0f
/** @defgroup fdcan1_crel_step STEP STEP
@{*/
/**@}*/


#define FDCAN1_CREL_SUBSTEP_SHIFT		20
#define FDCAN1_CREL_SUBSTEP_MASK		0x0f
/** @defgroup fdcan1_crel_substep SUBSTEP SUBSTEP
@{*/
/**@}*/


