grevaillot/svd_tools/headers/STM32G441xx/fdcan1.h
/** @defgroup fdcan1_ecr ECR FDCAN Error Counter Register
@{*/


#define FDCAN1_ECR_CEL_SHIFT		16
#define FDCAN1_ECR_CEL_MASK		0xff
/** @defgroup fdcan1_ecr_cel CEL CEL
@{*/
/**@}*/

/** FDCAN1_ECR_RP RP **/
#define FDCAN1_ECR_RP		(1 << 15)

#define FDCAN1_ECR_TREC_SHIFT		8
#define FDCAN1_ECR_TREC_MASK		0x7f
/** @defgroup fdcan1_ecr_trec TREC TREC
@{*/
/**@}*/


#define FDCAN1_ECR_TEC_SHIFT		0
#define FDCAN1_ECR_TEC_MASK		0xff
/** @defgroup fdcan1_ecr_tec TEC TEC
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_psr PSR FDCAN Protocol Status Register
@{*/


#define FDCAN1_PSR_TDCV_SHIFT		16
#define FDCAN1_PSR_TDCV_MASK		0x7f
/** @defgroup fdcan1_psr_tdcv TDCV TDCV
@{*/
/**@}*/

/** FDCAN1_PSR_PXE PXE **/
#define FDCAN1_PSR_PXE		(1 << 14)
/** FDCAN1_PSR_REDL REDL **/
#define FDCAN1_PSR_REDL		(1 << 13)
/** FDCAN1_PSR_RBRS RBRS **/
#define FDCAN1_PSR_RBRS		(1 << 12)
/** FDCAN1_PSR_RESI RESI **/
#define FDCAN1_PSR_RESI		(1 << 11)

#define FDCAN1_PSR_DLEC_SHIFT		8
#define FDCAN1_PSR_DLEC_MASK		0x07
/** @defgroup fdcan1_psr_dlec DLEC DLEC
@{*/
/**@}*/

/** FDCAN1_PSR_BO BO **/
#define FDCAN1_PSR_BO		(1 << 7)
/** FDCAN1_PSR_EW EW **/
#define FDCAN1_PSR_EW		(1 << 6)
/** FDCAN1_PSR_EP EP **/
#define FDCAN1_PSR_EP		(1 << 5)

#define FDCAN1_PSR_ACT_SHIFT		3
#define FDCAN1_PSR_ACT_MASK		0x03
/** @defgroup fdcan1_psr_act ACT ACT
@{*/
/**@}*/


#define FDCAN1_PSR_LEC_SHIFT		0
#define FDCAN1_PSR_LEC_MASK		0x07
/** @defgroup fdcan1_psr_lec LEC LEC
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_tdcr TDCR FDCAN Transmitter Delay Compensation Register
@{*/


#define FDCAN1_TDCR_TDCO_SHIFT		8
#define FDCAN1_TDCR_TDCO_MASK		0x7f
/** @defgroup fdcan1_tdcr_tdco TDCO TDCO
@{*/
/**@}*/


#define FDCAN1_TDCR_TDCF_SHIFT		0
#define FDCAN1_TDCR_TDCF_MASK		0x7f
/** @defgroup fdcan1_tdcr_tdcf TDCF TDCF
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_ir IR The flags are set when one of the listed conditions is detected (edge-sensitive). The flags remain set until the Host clears them. A flag is cleared by writing a 1 to the corresponding bit position. Writing a 0 has no effect. A hard reset will clear the register. The configuration of IE controls whether an interrupt is generated. The configuration of ILS controls on which interrupt line an interrupt is signaled.
@{*/

/** FDCAN1_IR_ARA ARA **/
#define FDCAN1_IR_ARA		(1 << 29)
/** FDCAN1_IR_PED PED **/
#define FDCAN1_IR_PED		(1 << 28)
/** FDCAN1_IR_PEA PEA **/
#define FDCAN1_IR_PEA		(1 << 27)
/** FDCAN1_IR_WDI WDI **/
#define FDCAN1_IR_WDI		(1 << 26)
/** FDCAN1_IR_BO BO **/
#define FDCAN1_IR_BO		(1 << 25)
/** FDCAN1_IR_EW EW **/
#define FDCAN1_IR_EW		(1 << 24)
/** FDCAN1_IR_EP EP **/
#define FDCAN1_IR_EP		(1 << 23)
/** FDCAN1_IR_ELO ELO **/
#define FDCAN1_IR_ELO		(1 << 22)
/** FDCAN1_IR_DRX DRX **/
#define FDCAN1_IR_DRX		(1 << 19)
/** FDCAN1_IR_TOO TOO **/
#define FDCAN1_IR_TOO		(1 << 18)
/** FDCAN1_IR_MRAF MRAF **/
#define FDCAN1_IR_MRAF		(1 << 17)
/** FDCAN1_IR_TSW TSW **/
#define FDCAN1_IR_TSW		(1 << 16)
/** FDCAN1_IR_TEFL TEFL **/
#define FDCAN1_IR_TEFL		(1 << 15)
/** FDCAN1_IR_TEFF TEFF **/
#define FDCAN1_IR_TEFF		(1 << 14)
/** FDCAN1_IR_TEFW TEFW **/
#define FDCAN1_IR_TEFW		(1 << 13)
/** FDCAN1_IR_TEFN TEFN **/
#define FDCAN1_IR_TEFN		(1 << 12)
/** FDCAN1_IR_TFE TFE **/
#define FDCAN1_IR_TFE		(1 << 11)
/** FDCAN1_IR_TCF TCF **/
#define FDCAN1_IR_TCF		(1 << 10)
/** FDCAN1_IR_TC TC **/
#define FDCAN1_IR_TC		(1 << 9)
/** FDCAN1_IR_HPM HPM **/
#define FDCAN1_IR_HPM		(1 << 8)
/** FDCAN1_IR_RF1L RF1L **/
#define FDCAN1_IR_RF1L		(1 << 7)
/** FDCAN1_IR_RF1F RF1F **/
#define FDCAN1_IR_RF1F		(1 << 6)
/** FDCAN1_IR_RF1W RF1W **/
#define FDCAN1_IR_RF1W		(1 << 5)
/** FDCAN1_IR_RF1N RF1N **/
#define FDCAN1_IR_RF1N		(1 << 4)
/** FDCAN1_IR_RF0L RF0L **/
#define FDCAN1_IR_RF0L		(1 << 3)
/** FDCAN1_IR_RF0F RF0F **/
#define FDCAN1_IR_RF0F		(1 << 2)
/** FDCAN1_IR_RF0W RF0W **/
#define FDCAN1_IR_RF0W		(1 << 1)
/** FDCAN1_IR_RF0N RF0N **/
#define FDCAN1_IR_RF0N		(1 << 0)

/**@}*/

/** @defgroup fdcan1_ie IE The settings in the Interrupt Enable register determine which status changes in the Interrupt Register will be signaled on an interrupt line.
@{*/

/** FDCAN1_IE_ARAE ARAE **/
#define FDCAN1_IE_ARAE		(1 << 29)
/** FDCAN1_IE_PEDE PEDE **/
#define FDCAN1_IE_PEDE		(1 << 28)
/** FDCAN1_IE_PEAE PEAE **/
#define FDCAN1_IE_PEAE		(1 << 27)
/** FDCAN1_IE_WDIE WDIE **/
#define FDCAN1_IE_WDIE		(1 << 26)
/** FDCAN1_IE_BOE BOE **/
#define FDCAN1_IE_BOE		(1 << 25)
/** FDCAN1_IE_EWE EWE **/
#define FDCAN1_IE_EWE		(1 << 24)
/** FDCAN1_IE_EPE EPE **/
#define FDCAN1_IE_EPE		(1 << 23)
/** FDCAN1_IE_ELOE ELOE **/
#define FDCAN1_IE_ELOE		(1 << 22)
/** FDCAN1_IE_BEUE BEUE **/
#define FDCAN1_IE_BEUE		(1 << 21)
/** FDCAN1_IE_BECE BECE **/
#define FDCAN1_IE_BECE		(1 << 20)
/** FDCAN1_IE_DRX DRX **/
#define FDCAN1_IE_DRX		(1 << 19)
/** FDCAN1_IE_TOOE TOOE **/
#define FDCAN1_IE_TOOE		(1 << 18)
/** FDCAN1_IE_MRAFE MRAFE **/
#define FDCAN1_IE_MRAFE		(1 << 17)
/** FDCAN1_IE_TSWE TSWE **/
#define FDCAN1_IE_TSWE		(1 << 16)
/** FDCAN1_IE_TEFLE TEFLE **/
#define FDCAN1_IE_TEFLE		(1 << 15)
/** FDCAN1_IE_TEFFE TEFFE **/
#define FDCAN1_IE_TEFFE		(1 << 14)
/** FDCAN1_IE_TEFWE TEFWE **/
#define FDCAN1_IE_TEFWE		(1 << 13)
/** FDCAN1_IE_TEFNE TEFNE **/
#define FDCAN1_IE_TEFNE		(1 << 12)
/** FDCAN1_IE_TFEE TFEE **/
#define FDCAN1_IE_TFEE		(1 << 11)
/** FDCAN1_IE_TCFE TCFE **/
#define FDCAN1_IE_TCFE		(1 << 10)
/** FDCAN1_IE_TCE TCE **/
#define FDCAN1_IE_TCE		(1 << 9)
/** FDCAN1_IE_HPME HPME **/
#define FDCAN1_IE_HPME		(1 << 8)
/** FDCAN1_IE_RF1LE RF1LE **/
#define FDCAN1_IE_RF1LE		(1 << 7)
/** FDCAN1_IE_RF1FE RF1FE **/
#define FDCAN1_IE_RF1FE		(1 << 6)
/** FDCAN1_IE_RF1WE RF1WE **/
#define FDCAN1_IE_RF1WE		(1 << 5)
/** FDCAN1_IE_RF1NE RF1NE **/
#define FDCAN1_IE_RF1NE		(1 << 4)
/** FDCAN1_IE_RF0LE RF0LE **/
#define FDCAN1_IE_RF0LE		(1 << 3)
/** FDCAN1_IE_RF0FE RF0FE **/
#define FDCAN1_IE_RF0FE		(1 << 2)
/** FDCAN1_IE_RF0WE RF0WE **/
#define FDCAN1_IE_RF0WE		(1 << 1)
/** FDCAN1_IE_RF0NE RF0NE **/
#define FDCAN1_IE_RF0NE		(1 << 0)

/**@}*/

