grevaillot/svd_tools/headers/STM32G441xx/fdcan1.h
/** @defgroup fdcan1_ils ILS The Interrupt Line Select register assigns an interrupt generated by a specific interrupt flag from the Interrupt Register to one of the two module interrupt lines. For interrupt generation the respective interrupt line has to be enabled via ILE[EINT0] and ILE[EINT1].
@{*/

/** FDCAN1_ILS_ARAL ARAL **/
#define FDCAN1_ILS_ARAL		(1 << 29)
/** FDCAN1_ILS_PEDL PEDL **/
#define FDCAN1_ILS_PEDL		(1 << 28)
/** FDCAN1_ILS_PEAL PEAL **/
#define FDCAN1_ILS_PEAL		(1 << 27)
/** FDCAN1_ILS_WDIL WDIL **/
#define FDCAN1_ILS_WDIL		(1 << 26)
/** FDCAN1_ILS_BOL BOL **/
#define FDCAN1_ILS_BOL		(1 << 25)
/** FDCAN1_ILS_EWL EWL **/
#define FDCAN1_ILS_EWL		(1 << 24)
/** FDCAN1_ILS_EPL EPL **/
#define FDCAN1_ILS_EPL		(1 << 23)
/** FDCAN1_ILS_ELOL ELOL **/
#define FDCAN1_ILS_ELOL		(1 << 22)
/** FDCAN1_ILS_BEUL BEUL **/
#define FDCAN1_ILS_BEUL		(1 << 21)
/** FDCAN1_ILS_BECL BECL **/
#define FDCAN1_ILS_BECL		(1 << 20)
/** FDCAN1_ILS_DRXL DRXL **/
#define FDCAN1_ILS_DRXL		(1 << 19)
/** FDCAN1_ILS_TOOL TOOL **/
#define FDCAN1_ILS_TOOL		(1 << 18)
/** FDCAN1_ILS_MRAFL MRAFL **/
#define FDCAN1_ILS_MRAFL		(1 << 17)
/** FDCAN1_ILS_TSWL TSWL **/
#define FDCAN1_ILS_TSWL		(1 << 16)
/** FDCAN1_ILS_TEFLL TEFLL **/
#define FDCAN1_ILS_TEFLL		(1 << 15)
/** FDCAN1_ILS_TEFFL TEFFL **/
#define FDCAN1_ILS_TEFFL		(1 << 14)
/** FDCAN1_ILS_TEFWL TEFWL **/
#define FDCAN1_ILS_TEFWL		(1 << 13)
/** FDCAN1_ILS_TEFNL TEFNL **/
#define FDCAN1_ILS_TEFNL		(1 << 12)
/** FDCAN1_ILS_TFEL TFEL **/
#define FDCAN1_ILS_TFEL		(1 << 11)
/** FDCAN1_ILS_TCFL TCFL **/
#define FDCAN1_ILS_TCFL		(1 << 10)
/** FDCAN1_ILS_TCL TCL **/
#define FDCAN1_ILS_TCL		(1 << 9)
/** FDCAN1_ILS_HPML HPML **/
#define FDCAN1_ILS_HPML		(1 << 8)
/** FDCAN1_ILS_RF1LL RF1LL **/
#define FDCAN1_ILS_RF1LL		(1 << 7)
/** FDCAN1_ILS_RF1FL RF1FL **/
#define FDCAN1_ILS_RF1FL		(1 << 6)
/** FDCAN1_ILS_RF1WL RF1WL **/
#define FDCAN1_ILS_RF1WL		(1 << 5)
/** FDCAN1_ILS_RF1NL RF1NL **/
#define FDCAN1_ILS_RF1NL		(1 << 4)
/** FDCAN1_ILS_RF0LL RF0LL **/
#define FDCAN1_ILS_RF0LL		(1 << 3)
/** FDCAN1_ILS_RF0FL RF0FL **/
#define FDCAN1_ILS_RF0FL		(1 << 2)
/** FDCAN1_ILS_RF0WL RF0WL **/
#define FDCAN1_ILS_RF0WL		(1 << 1)
/** FDCAN1_ILS_RF0NL RF0NL **/
#define FDCAN1_ILS_RF0NL		(1 << 0)

/**@}*/

/** @defgroup fdcan1_ile ILE Each of the two interrupt lines to the CPU can be enabled/disabled separately by programming bits EINT0 and EINT1.
@{*/

/** FDCAN1_ILE_EINT1 EINT1 **/
#define FDCAN1_ILE_EINT1		(1 << 1)
/** FDCAN1_ILE_EINT0 EINT0 **/
#define FDCAN1_ILE_EINT0		(1 << 0)

/**@}*/

/** @defgroup fdcan1_rxgfc RXGFC Global settings for Message ID filtering. The Global Filter Configuration controls the filter path for standard and extended messages as described in Figure706: Standard Message ID filter path and Figure707: Extended Message ID filter path.
@{*/


#define FDCAN1_RXGFC_ANFS_SHIFT		4
#define FDCAN1_RXGFC_ANFS_MASK		0x03
/** @defgroup fdcan1_rxgfc_anfs ANFS ANFS
@{*/
/**@}*/


#define FDCAN1_RXGFC_ANFE_SHIFT		2
#define FDCAN1_RXGFC_ANFE_MASK		0x03
/** @defgroup fdcan1_rxgfc_anfe ANFE ANFE
@{*/
/**@}*/

/** FDCAN1_RXGFC_RRFS RRFS **/
#define FDCAN1_RXGFC_RRFS		(1 << 1)
/** FDCAN1_RXGFC_RRFE RRFE **/
#define FDCAN1_RXGFC_RRFE		(1 << 0)

/**@}*/

/** @defgroup fdcan1_xidam XIDAM FDCAN Extended ID and Mask Register
@{*/


#define FDCAN1_XIDAM_EIDM_SHIFT		0
#define FDCAN1_XIDAM_EIDM_MASK		0x1fffffff
/** @defgroup fdcan1_xidam_eidm EIDM EIDM
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_hpms HPMS This register is updated every time a Message ID filter element configured to generate a priority event match. This can be used to monitor the status of incoming high priority messages and to enable fast access to these messages.
@{*/

/** FDCAN1_HPMS_FLST FLST **/
#define FDCAN1_HPMS_FLST		(1 << 15)

#define FDCAN1_HPMS_FIDX_SHIFT		8
#define FDCAN1_HPMS_FIDX_MASK		0x7f
/** @defgroup fdcan1_hpms_fidx FIDX FIDX
@{*/
/**@}*/


#define FDCAN1_HPMS_MSI_SHIFT		6
#define FDCAN1_HPMS_MSI_MASK		0x03
/** @defgroup fdcan1_hpms_msi MSI MSI
@{*/
/**@}*/


#define FDCAN1_HPMS_BIDX_SHIFT		0
#define FDCAN1_HPMS_BIDX_MASK		0x3f
/** @defgroup fdcan1_hpms_bidx BIDX BIDX
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_rxf0s RXF0S FDCAN Rx FIFO 0 Status Register
@{*/

/** FDCAN1_RXF0S_RF0L RF0L **/
#define FDCAN1_RXF0S_RF0L		(1 << 25)
/** FDCAN1_RXF0S_F0F F0F **/
#define FDCAN1_RXF0S_F0F		(1 << 24)

#define FDCAN1_RXF0S_F0PI_SHIFT		16
#define FDCAN1_RXF0S_F0PI_MASK		0x3f
/** @defgroup fdcan1_rxf0s_f0pi F0PI F0PI
@{*/
/**@}*/


#define FDCAN1_RXF0S_F0GI_SHIFT		8
#define FDCAN1_RXF0S_F0GI_MASK		0x3f
/** @defgroup fdcan1_rxf0s_f0gi F0GI F0GI
@{*/
/**@}*/


#define FDCAN1_RXF0S_F0FL_SHIFT		0
#define FDCAN1_RXF0S_F0FL_MASK		0x7f
/** @defgroup fdcan1_rxf0s_f0fl F0FL F0FL
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_rxf0a RXF0A CAN Rx FIFO 0 Acknowledge Register
@{*/


#define FDCAN1_RXF0A_F0AI_SHIFT		0
#define FDCAN1_RXF0A_F0AI_MASK		0x3f
/** @defgroup fdcan1_rxf0a_f0ai F0AI F0AI
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_rxf1s RXF1S FDCAN Rx FIFO 1 Status Register
@{*/


#define FDCAN1_RXF1S_DMS_SHIFT		30
#define FDCAN1_RXF1S_DMS_MASK		0x03
/** @defgroup fdcan1_rxf1s_dms DMS DMS
@{*/
/**@}*/

/** FDCAN1_RXF1S_RF1L RF1L **/
#define FDCAN1_RXF1S_RF1L		(1 << 25)
/** FDCAN1_RXF1S_F1F F1F **/
#define FDCAN1_RXF1S_F1F		(1 << 24)

#define FDCAN1_RXF1S_F1PI_SHIFT		16
#define FDCAN1_RXF1S_F1PI_MASK		0x3f
/** @defgroup fdcan1_rxf1s_f1pi F1PI F1PI
@{*/
/**@}*/


#define FDCAN1_RXF1S_F1GI_SHIFT		8
#define FDCAN1_RXF1S_F1GI_MASK		0x3f
/** @defgroup fdcan1_rxf1s_f1gi F1GI F1GI
@{*/
/**@}*/


#define FDCAN1_RXF1S_F1FL_SHIFT		0
#define FDCAN1_RXF1S_F1FL_MASK		0x7f
/** @defgroup fdcan1_rxf1s_f1fl F1FL F1FL
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_rxf1a RXF1A FDCAN Rx FIFO 1 Acknowledge Register
@{*/


#define FDCAN1_RXF1A_F1AI_SHIFT		0
#define FDCAN1_RXF1A_F1AI_MASK		0x3f
/** @defgroup fdcan1_rxf1a_f1ai F1AI F1AI
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_txbc TXBC FDCAN Tx Buffer Configuration Register
@{*/

/** FDCAN1_TXBC_TFQM TFQM **/
#define FDCAN1_TXBC_TFQM		(1 << 30)

#define FDCAN1_TXBC_TFQS_SHIFT		24
#define FDCAN1_TXBC_TFQS_MASK		0x3f
/** @defgroup fdcan1_txbc_tfqs TFQS TFQS
@{*/
/**@}*/


#define FDCAN1_TXBC_NDTB_SHIFT		16
#define FDCAN1_TXBC_NDTB_MASK		0x3f
/** @defgroup fdcan1_txbc_ndtb NDTB NDTB
@{*/
/**@}*/


