grevaillot/svd_tools/headers/STM32G441xx/fdcan1.h
#define FDCAN1_TXBC_TBSA_SHIFT		2
#define FDCAN1_TXBC_TBSA_MASK		0x3fff
/** @defgroup fdcan1_txbc_tbsa TBSA TBSA
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_txfqs TXFQS The Tx FIFO/Queue status is related to the pending Tx requests listed in register TXBRP. Therefore the effect of Add/Cancellation requests may be delayed due to a running Tx scan (TXBRP not yet updated).
@{*/

/** FDCAN1_TXFQS_TFQF TFQF **/
#define FDCAN1_TXFQS_TFQF		(1 << 21)

#define FDCAN1_TXFQS_TFQPI_SHIFT		16
#define FDCAN1_TXFQS_TFQPI_MASK		0x1f
/** @defgroup fdcan1_txfqs_tfqpi TFQPI TFQPI
@{*/
/**@}*/


#define FDCAN1_TXFQS_TFGI_SHIFT		8
#define FDCAN1_TXFQS_TFGI_MASK		0x1f
/** @defgroup fdcan1_txfqs_tfgi TFGI TFGI
@{*/
/**@}*/


#define FDCAN1_TXFQS_TFFL_SHIFT		0
#define FDCAN1_TXFQS_TFFL_MASK		0x3f
/** @defgroup fdcan1_txfqs_tffl TFFL TFFL
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_txbrp TXBRP FDCAN Tx Buffer Request Pending Register
@{*/


#define FDCAN1_TXBRP_TRP_SHIFT		0
#define FDCAN1_TXBRP_TRP_MASK		0xffffffff
/** @defgroup fdcan1_txbrp_trp TRP TRP
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_txbar TXBAR FDCAN Tx Buffer Add Request Register
@{*/


#define FDCAN1_TXBAR_AR_SHIFT		0
#define FDCAN1_TXBAR_AR_MASK		0xffffffff
/** @defgroup fdcan1_txbar_ar AR AR
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_txbcr TXBCR FDCAN Tx Buffer Cancellation Request Register
@{*/


#define FDCAN1_TXBCR_CR_SHIFT		0
#define FDCAN1_TXBCR_CR_MASK		0xffffffff
/** @defgroup fdcan1_txbcr_cr CR CR
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_txbto TXBTO FDCAN Tx Buffer Transmission Occurred Register
@{*/


#define FDCAN1_TXBTO_TO_SHIFT		0
#define FDCAN1_TXBTO_TO_MASK		0xffffffff
/** @defgroup fdcan1_txbto_to TO TO
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_txbcf TXBCF FDCAN Tx Buffer Cancellation Finished Register
@{*/


#define FDCAN1_TXBCF_CF_SHIFT		0
#define FDCAN1_TXBCF_CF_MASK		0xffffffff
/** @defgroup fdcan1_txbcf_cf CF CF
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_txbtie TXBTIE FDCAN Tx Buffer Transmission Interrupt Enable Register
@{*/


#define FDCAN1_TXBTIE_TIE_SHIFT		0
#define FDCAN1_TXBTIE_TIE_MASK		0xffffffff
/** @defgroup fdcan1_txbtie_tie TIE TIE
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_txbcie TXBCIE FDCAN Tx Buffer Cancellation Finished Interrupt Enable Register
@{*/


#define FDCAN1_TXBCIE_CFIE_SHIFT		0
#define FDCAN1_TXBCIE_CFIE_MASK		0xffffffff
/** @defgroup fdcan1_txbcie_cfie CFIE CFIE
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_txefs TXEFS FDCAN Tx Event FIFO Status Register
@{*/

/** FDCAN1_TXEFS_TEFL TEFL **/
#define FDCAN1_TXEFS_TEFL		(1 << 25)
/** FDCAN1_TXEFS_EFF EFF **/
#define FDCAN1_TXEFS_EFF		(1 << 24)

#define FDCAN1_TXEFS_EFPI_SHIFT		16
#define FDCAN1_TXEFS_EFPI_MASK		0x1f
/** @defgroup fdcan1_txefs_efpi EFPI EFPI
@{*/
/**@}*/


#define FDCAN1_TXEFS_EFGI_SHIFT		8
#define FDCAN1_TXEFS_EFGI_MASK		0x1f
/** @defgroup fdcan1_txefs_efgi EFGI EFGI
@{*/
/**@}*/


#define FDCAN1_TXEFS_EFFL_SHIFT		0
#define FDCAN1_TXEFS_EFFL_MASK		0x3f
/** @defgroup fdcan1_txefs_effl EFFL EFFL
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_txefa TXEFA FDCAN Tx Event FIFO Acknowledge Register
@{*/


#define FDCAN1_TXEFA_EFAI_SHIFT		0
#define FDCAN1_TXEFA_EFAI_MASK		0x1f
/** @defgroup fdcan1_txefa_efai EFAI EFAI
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_ckdiv CKDIV FDCAN CFG clock divider register
@{*/


#define FDCAN1_CKDIV_PDIV_SHIFT		0
#define FDCAN1_CKDIV_PDIV_MASK		0x0f
/** @defgroup fdcan1_ckdiv_pdiv PDIV input clock divider. the APB clock could be divided prior to be used by the CAN sub
@{*/
/**@}*/


/**@}*/
